app/controllers/movies_controller.rb

  def index
    handle_session()
    #setup all the ratings or the selected ratings
    @movies = Movie.order(params[:sort]).restrict_by_rating(params[:ratings])
---
SELECT "movies".* FROM "movies" ORDER BY release_date